'''
*
В структуре данных из 5 урока задание №2 каждому сотруднику 
добавить к параметру "навык" параметр "мастерство" измеряемый от 0 до 100

Написать программу которая анализирует всю структуру данных и выводит сотрудников
с наибольшим параметром "мастерство" для каждого существующего навыка.
Пример вывода:
    1. Python - Иванов - 98
    2. JS - Петров  - 74     
    3. Базы данных - Николаев - 87     
    ...


** Пример вывода (перед выводам отсортировать по убыванию "мастерства"):
    
    --------------------------------------------------
    | № |   Навык     |       ФИО       | Мастерство |
    ==================================================
    | 1 | Python      | Иванов Н.С.     |     98     |
    | 2 | JS          | Петров В.В.     |     87     |
    | 3 | Базы данных | Николаев Е.Н.   |     74     |
    ...

 

'''
dt = {
'Иванов Иван Иванович':{
	'name': 'Иванов Иван Иванович',
	'rank':'Водитель', 
	'year':1975, 
	'skill': {'Python' : 83,
			  'SQL' : 95,
			  'JS' : 86}, 
	'child' : [{'name':'Василий', 'year': 2006},
		   	   {'name':'Сергей', 'year': 2008}]},

'Петров Петр Петрович':{
	'name': 'Петров Петр Петрович',
	'rank':'Программист', 
	'year':1986, 
	'skill': {'Python' : 99,
			  'JS' : 90,
			  'SQL' : 65},
	'child' : [{'name':'Акакий', 'year': 2005},
			   {'name':'Екатерина', 'year': 2010}]},
			   
'Гусева Екатерина Константиновна':{
	'name': 'Гусева Екатерина Константиновна',
	'rank':'Актриса',
	'year':1976,
	'skill': {'Python' : 83, 
			   'JS' : 91, 
			   'SQL' : 93},
	'child' : [{'name':'Алексей', 'year': 1998}]},
}

skills = list(dt[list(dt.keys())[0]]['skill'])

j = []
for skill in skills:
	vdt = sorted(dt.items(), key=lambda i: i[1]['skill'][skill], reverse = True)
	j.append([skill,vdt[0][0],vdt[0][1]['skill'][skill]])
lis = []
j = sorted(j, key=lambda i: i[2], reverse = True)
for i in range(1,len(j)+1):
	lis.append([i,
				j[i-1][0],
				j[i-1][1].split()[0]+' '+j[i-1][1].split()[1][0]+\
				'.'+ j[i-1][1].split()[2][0] + '.',
				j[i-1][2]])

# понимаю что чуть не так нужно было но не успевал по другому сделать
print('''    --------------------------------------------------
    | № |   Навык     |       ФИО       | Мастерство |
    ==================================================''')
print('\n'.join(f'    |{str(i[0]).center(3)}|{str(i[1]).center(13)}|{str(i[2]).center(17)}|{str(i[3]).center(12)}|' for i in lis))
