'''
Запросить по очереди у пользователя 5 имен. Добавить все в список. 
Отсортировать. 
Вывести на экран.
Вывести True при наличии в списке имени 'Вася'
'''

s = sorted([input(),input(),input(),input(),input()])
print(s)
print('Вася' in s)
