'''
Дан произвольный список. Вывести на экран в обратном порядке. 
Задачу решить 2мя способами. 
'''
l = input()
print(l[::-1])
print(''.join(reversed(l)))
