'''
Дан список
['samsung', 'lg', 'xerox', 'bosch']
Удалить элемент с именем 'xerox'
Добавить элемент на 2 место 'indesit'

'''
l = ['samsung', 'lg', 'xerox', 'bosch']
l.remove('xerox')
l.insert(1,'indesit')
print(l)
